		<section class="pt-5">

			<div class="container">
				<h1 class="fw-bold fs-6 mb-3">ความเป็นมา</h1>
				<div class="mb-6">
				<nav aria-label="breadcrumb">
					 <ol class="breadcrumb">
						<li class="breadcrumb-item"><a href="<?=base_url()?>">หน้าหลัก</a></li>
						<li class="breadcrumb-item active" aria-current="page">ความเป็นมา</li>
					</ol>
				</nav>
				</div>
				
				<div class="row">
					<div class="col-12">
					<p class="text-center mb-5">
						<!--<img src="https://cftourismdata.com/template/images/logo.png?v=1" style="max-width:40%">-->
					</p>
					<p>ปัจจุบันการพัฒนาการท่องเที่ยวในหลายประเทศทั่วโลก ได้ให้ความสำคัญกับผลกระทบต่อสิ่งแวดล้อมที่เกิดจากพฤติกรรมการบริโภคของนักท่องเที่ยวและจากการดำเนินงานของธุรกิจท่องเที่ยว โดยเฉพาะกิจกรรมหลักในการท่องเที่ยว ได้แก่ การขนส่ง โรงแรม ที่พัก และสิ่งอำนวยความสะดวกต่าง ๆ 
					ในแหล่งท่องเที่ยว ที่ก่อให้เกิดก๊าซเรือนกระจก (Greenhouse gas: GHG) อันเป็นต้นเหตุสำคัญของภาวะโลกร้อน</p>
					<p>การท่องเที่ยวแห่งประเทศไทย (ททท.) ได้ตระหนักถึงความสำคัญของผลกระทบจากกิจกรรมการท่องเที่ยวต่อสิ่งแวดล้อม และต้องการผลักดันทั้งในระดับนโยบายและการปฏิบัติการเพื่อให้เกิดการปรับเปลี่ยนพฤติกรรมการดำเนินธุรกิจของผู้ประกอบการในการผลิตและการให้บริการที่เป็นมิตรกับสิ่งแวดล้อม รวมทั้งการเพิ่มโอกาสการเข้าถึงและขยายตลาดสินค้าและบริการที่เป็นมิตรกับสิ่งแวดล้อมให้แก่นักท่องเที่ยว และที่สำคัญสามารถลดต้นทุนของผู้ประกอบการจากการใช้ทรัพยากรและพลังงานอย่างคุ้มค่าและมีประสิทธิภาพ</p>
					<p>ดังนั้น ททท. จึงได้ร่วมมือกับหน่วยวิจัยเพื่อการจัดการพลังงานและเศรษฐนิเวศ สถาบันวิจัยวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยเชียงใหม่ จัดทำแพลตฟอร์มออนไลน์นี้ขึ้นเพื่อให้ผู้ประกอบการโรงแรมและที่พักสามารถสร้างฐานข้อมูลบัญชีรายการสิ่งแวดล้อม (พลังงาน น้ำ ของเสีย และก๊าซเรือนกระจก) และคำนวณปริมาณคาร์บอนฟุตพริ้นท์ที่ปล่อยจากกิจกรรมในการดำเนินธุรกิจโรงแรมและที่พัก ซึ่งจะสะท้อนการดำเนินงานของธุรกิจโรงแรมและที่พักที่ส่งผลกระทบต่อสิ่งแวดล้อม และสามารถบ่งชี้ถึงศักยภาพ
					การบริหารจัดการที่ผ่านมาว่าธุรกิจประสบความสำเร็จในการบริหารจัดการอย่างยั่งยืนมากน้อยเพียงใด อีกทั้ง ยังสามารถนำมาวิเคราะห์เพื่อหาแนวทางในการลดการปล่อยก๊าซเรือนกระจก อันจะเป็นข้อมูลประกอบการตัดสินใจการบริหารธุรกิจในการเพิ่มรายได้และลดค่าใช้จ่ายจากการใช้พลังงานได้อย่างเหมาะสม</p>

					</div>
				</div>
			</div>
		
		</section>